index=main sourcetype="XmlWinEventLog:Microsoft-Windows-Sysmon/Operational"
EventCode=1 Image="*\\schtasks.exe"
| where match(lower(CommandLine), "(?i)(/create|-create)")
| table _time host User Image CommandLine ParentImage ProcessId
| sort - _time
